TheBToby/voice-assistant/firmware/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Target: Seeed Studio reSpeaker XVF3800 carrier (XIAO ESP32-S3 module)
#   8 MB quad flash, 8 MB octal PSRAM
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# Network + LiveKit connection (see firmware/README.md)
# Token: mint with `make token ID=respeaker-1 ROOM=home` from the repo root,
# then paste it below (or via `idf.py menuconfig`).
# ---------------------------------------------------------------------------
CONFIG_LK_EXAMPLE_USE_WIFI=y
CONFIG_LK_EXAMPLE_WIFI_SSID="Mikrowelle_IoT"
CONFIG_LK_EXAMPLE_WIFI_PASSWORD="IoT@Baechtold#4410"
CONFIG_LK_EXAMPLE_SERVER_URL="ws://192.168.0.29:7880"
CONFIG_LK_EXAMPLE_TOKEN="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJuYW1lIjoicmVTcGVha2VyIiwidmlkZW8iOnsicm9vbUpvaW4iOnRydWUsInJvb20iOiJob21lIiwiY2FuUHVibGlzaCI6dHJ1ZSwiY2FuU3Vic2NyaWJlIjp0cnVlLCJjYW5QdWJsaXNoRGF0YSI6dHJ1ZX0sInN1YiI6InJlU3BlYWtlciIsImlzcyI6IkdLNTVXcWFLZmY0NjRIc1I2aEVBUDZxZWRTRFBER3ltIiwibmJmIjoxNzg4NzYyMDQyLCJleHAiOjE3ODg4MDUyNDJ9.3y_bXqOOXfIHRW2tuUMjcOI_ZEXxghA1Mz2Wb3UV0sE"

# ---------------------------------------------------------------------------
# Console: the XVF3800 I2S data pins are GPIO43/44, which are also the
# ESP32-S3's default UART0 TX/RX. Route the console to the USB Serial/JTAG
# controller instead (same USB-C port, shows up as /dev/ttyACM0).
# ---------------------------------------------------------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---------------------------------------------------------------------------
# XIAO ESP32-S3 memory layout
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# ---------------------------------------------------------------------------
# Performance / media stack (from the SDK's minimal example)
# ---------------------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# ---------------------------------------------------------------------------
# Voice assistant features (wake word, AGC, chimes, LEDs, local timers).
# See main/Kconfig.projbuild "Voice Assistant Features" for all options.
# ---------------------------------------------------------------------------
# Wake word model packed into the 'model' partition (partitions.csv).
CONFIG_SR_WN_WN9_HEYWILLOW_TTS=y
CONFIG_MODEL_IN_FLASH=y
# Wake word sensitivity: TTS models run natively around 0.65; 0.7 cuts the
# false accepts seen at 0.5 in a normal living room.
CONFIG_LK_WAKE_WORD_THRESHOLD_PERMILLE=700
